In [21]:
import pandas as pd

data = {
    "Id_Producto": [1, 2, 1, 4, 5],
    "Nombre_Producto": ["Manzana", "Pera", "Uva", "Banana", "Fresa"],
    "precio": [50.5, None, 20.0, 15.0, None],
    "cantidad": [None, 20, None, 40, 50],
}

df = pd.DataFrame(data)
df

   Id_Producto Nombre_Producto  precio  cantidad
0            1         Manzana    50.5       NaN
1            2            Pera     NaN      20.0
2            1             Uva    20.0       NaN
3            4          Banana    15.0      40.0
4            5           Fresa     NaN      50.0

In [22]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Id_Producto      5 non-null      int64
 1   Nombre_Producto  5 non-null      object
 2   precio           3 non-null      float64
 3   cantidad         3 non-null      float64
dtypes: float64(2), int64(1), object(1)
memory usage: 292.0+ bytes

In [23]:
df.isnull().sum()

Id_Producto        0
Nombre_Producto    0
precio             2
cantidad           2
dtype: int64

In [24]:
dflimpio = df.dropna()
dflimpio

   Id_Producto Nombre_Producto  precio  cantidad
3            4          Banana    15.0      40.0

In [25]:
dfRellenado= df.fillna({"precio": df["precio"].mean(), "cantidad":0})
dfRellenado

   Id_Producto Nombre_Producto  precio  cantidad
0            1         Manzana    50.5       0.0
1            2            Pera    28.5      20.0
2            1             Uva    20.0       0.0
3            4          Banana    15.0      40.0
4            5           Fresa    28.5      50.0

In [26]:
dfUnicos = df.drop_duplicates(subset=["Id_Producto"])
dfUnicos

   Id_Producto Nombre_Producto  precio  cantidad
0            1         Manzana    50.5       NaN
1            2            Pera     NaN      20.0
3            4          Banana    15.0      40.0
4            5           Fresa     NaN      50.0